{"class_name": "Model", "keras_version": "1.0.7", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 400, 120], "name": "Framewise_Input", "input_dtype": "float32"}, "inbound_nodes": [], "name": "Framewise_Input"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 120, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 400, 120], "W_regularizer": null, "activation": "tanh", "nb_row": 3}, "inbound_nodes": [[["Framewise_Input", 0, 0]]], "name": "conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 398, 1], "W_regularizer": null, "activation": "tanh", "nb_row": 3}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "conv2"}, {"class_name": "Reshape", "config": {"target_shape": [101376, 1], "trainable": true, "name": "Reshape_1"}, "inbound_nodes": [[["conv2", 0, 0]]], "name": "Reshape_1"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "Permute_1"}, "inbound_nodes": [[["Reshape_1", 0, 0]]], "name": "Permute_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "Forward_LSTM_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 101376, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["Permute_1", 0, 0]]], "name": "Forward_LSTM_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "Backward_LSTM_1", "inner_activation": "hard_sigmoid", "go_backwards": true, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 101376, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["Permute_1", 0, 0]]], "name": "Backward_LSTM_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["Forward_LSTM_1", 0, 0], ["Backward_LSTM_1", 0, 0]]], "name": "merge_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "Forward_LSTM_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 512, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "Forward_LSTM_2"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "Backward_LSTM_2", "inner_activation": "hard_sigmoid", "go_backwards": true, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 512, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "Backward_LSTM_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["Forward_LSTM_2", 0, 0], ["Backward_LSTM_2", 0, 0]]], "name": "merge_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 512}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 40}}, "trainable": true, "name": "timedistributed_2"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "timedistributed_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "Softmax"}, "inbound_nodes": [[["timedistributed_2", 0, 0]]], "name": "Softmax"}], "input_layers": [["Framewise_Input", 0, 0]], "output_layers": [["Softmax", 0, 0]], "name": "model_1"}}