{"class_name": "Model", "keras_version": "1.0.7", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 405, 40], "name": "Framewise_Input", "input_dtype": "float32"}, "inbound_nodes": [], "name": "Framewise_Input"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 30, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 3, 405, 40], "W_regularizer": null, "activation": "tanh", "nb_row": 3}, "inbound_nodes": [[["Framewise_Input", 0, 0]]], "name": "conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 11, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 403, 1], "W_regularizer": null, "activation": "tanh", "nb_row": 3}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "conv2"}, {"class_name": "Reshape", "config": {"target_shape": [401, 128], "trainable": true, "name": "Reshape_1"}, "inbound_nodes": [[["conv2", 0, 0]]], "name": "Reshape_1"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "Forward_LSTM_1", "go_backwards": false, "output_dim": 256, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 128, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["Reshape_1", 0, 0]]], "name": "Forward_LSTM_1"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "Backward_LSTM_1", "go_backwards": true, "output_dim": 256, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 128, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["Reshape_1", 0, 0]]], "name": "Backward_LSTM_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["Forward_LSTM_1", 0, 0], ["Backward_LSTM_1", 0, 0]]], "name": "merge_1"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "Forward_LSTM_2", "go_backwards": false, "output_dim": 256, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "Forward_LSTM_2"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "Backward_LSTM_2", "go_backwards": true, "output_dim": 256, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "Backward_LSTM_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["Forward_LSTM_2", 0, 0], ["Backward_LSTM_2", 0, 0]]], "name": "merge_2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 40}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "Softmax"}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "Softmax"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 74], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "name": "input_length", "input_dtype": "int64"}, "inbound_nodes": [], "name": "input_length"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "name": "label_length", "input_dtype": "int64"}, "inbound_nodes": [], "name": "label_length"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000sM\u0000\u0000\u0000|\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000|\u0001\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0003\u0000\u0019}\u0001\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000|\u0001\u0000|\u0003\u0000|\u0004\u0000\u0083\u0004\u0000S(\u0002\u0000\u0000\u0000Ni\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000e\u0000\u0000\u0000ctc_batch_cost(\u0005\u0000\u0000\u0000t\u0004\u0000\u0000\u0000argst\u0006\u0000\u0000\u0000y_predt\u0006\u0000\u0000\u0000labelst\f\u0000\u0000\u0000input_lengtht\f\u0000\u0000\u0000label_length(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\"\u0000\u0000\u0000/home/XJJ/TIMIT/TheCode/MyModel.pyt\u000f\u0000\u0000\u0000ctc_lambda_func/\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\u0012\u0003%\u0001", "name": "CTC_Loss", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [1], "output_shape_type": "raw"}, "inbound_nodes": [[["Softmax", 0, 0], ["input_1", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]]], "name": "CTC_Loss"}], "input_layers": [["Framewise_Input", 0, 0], ["input_1", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["CTC_Loss", 0, 0]], "name": "model_1"}}